rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
            if (data_loss_percentage < best_data_loss_percentage) best_data_loss_percentage = data_loss_percentage;
        }

        //We now assume that we choose the lower of the two current connection intervals
        //being compared. We expect to get the higher connection interval 90% of the time
        //and the lower interval only 10% of the time.
        float expected_data_loss = 0.1 * current_expected_loss + 0.9 * best_data_loss_percentage;
        if (expected_data_loss < current_best_loss)
        {
            current_best_loss = expected_data_loss;
            best_minimum_interval = current_time - 15;
        }

        current_expected_loss = best_data_loss_percentage;
    }
    
    //Once all calculations are done, set the desired minimum and maximum connection
    //intervals based on the best_minimum_interval variable
    desired_minimum_connection_interval = best_minimum_interval;
    desired_maximum_connection_interval = desired_minimum_connection_interval + 15;
}

void set_sensor_samples(int actual_connection_interval)
{
    //As mentioned above in the alcualte_samples_and_connection_interval() method,
    //there's no guarantee as to what the connection interval is going to be set at.
    //Once the interval has been established we update the sample amount so that
    //sensor odr * sample amount is as close to the connection interval (without
    //exceeding it) as possible.
    for (int i = MAX_SENSOR_SAMPLES; i >= 0; i--)
    {
        if ((1000.0 * i / current_sensor_odr) < actual_connection_interval)
        {
            SEGGER_RTT_printf(0, "%d sensor samples selected.\n", i);
            m_current_sensor_samples = i;

            //Not 100% necesary here, however, it may be handy for debugging.
            //Print out the expected data loss per connection interval to 
            //confirm our selection was ok. Ideally this number would be a good
            //deal under 1 byte.
            float connection_cycle_length = findDecimalLCM(actual_connection_interval, 1000 * i / current_sensor_odr);

            float connection_intervals_per_cycle = connection_cycle_length / actual_connection_interval;
            float total_data_packets = connection_cycle_length / (1000 * i / current_sensor_odr);
            float total_data_loss_percent = (total_data_packets - connection_intervals_per_cycle) / total_data_packets; //bytes in a complete sensor reading

            SEGGER_RTT_printf(0, "Expected data loss is ~: %d%%\n", (uint32_t)(100 * total_data_loss_percent));
            break;
        }
    }
}

void set_sensor_samples_two(int actual_connection_interval)
{
    //For now just do nothing here
}

void data_read_handler(int measurements_taken)
{
    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values. The timer should go off SENSOR_SAMPLES times
    //every connection interval
    imu_comm.acc_comm.get_data(acc_characteristic_data, SAMPLE_SIZE * measurements_taken);
    imu_comm.gyr_comm.get_data(gyr_characteristic_data, SAMPLE_SIZE * measurements_taken);
    imu_comm.mag_comm.get_data(mag_characteristic_data, SAMPLE_SIZE * measurements_taken);
    //SEGGER_RTT_printf(0, "Readings complete at %d\n", get_current_data_time());
}


//Functions for updating sensor power modes and settings
static void sensor_idle_mode_start()
{ 
    //In this mode, the appropriate TWI bus(es) is active and power is going to the sensors but the 
    //sensors are put into sleep mode. A red LED on the board blinks during this mode
    if (current_operating_mode == SENSOR_IDLE_MODE) return; //no need to change anything if already in idle mode

    //swap to the red LED, also make sure that the blue and green LEDs are off
    active_led = RED_LED;
    nrf_gpio_pin_set(GREEN_LED); //LEDs must be set high to turn off
    nrf_gpio_pin_set(BLUE_LED); //LEDs must be set high to turn off

    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode.
        data_timers_stop();
        
        //Put all sensors into idle mode, any of the sensors that are active
        //will be properly initialized
        lsm9ds1_idle_mode_enable();
        fxos8700_idle_mode_enable();
        fxas21002_idle_mode_enable();

        //uint8_t reg_val;
        //imu_comm.acc_comm.read_register((void*)imu_comm.acc_comm.twi_bus,  imu_comm.acc_comm.address, FXOS8700_CTRL_REG1, &reg_val, 1);
        //SEGGER_RTT_printf(0, "CTRL_REG1 Register After idel mode enable: %x\n", reg_val);

        //the LED is deactivated during data collection so turn it back on
        led_timers_start();
    }
    else 
    {
        //If we aren't in sensor active or idle mode, it means that we arrived here from connection mode.
        //This means that both the TWI bus and sensors need to be turned on. There are two reasons why we'd
        //be turning on the sensors, either we're about to take data readings, or, we want to update the
        //sensor settings. In both cases we need to turn on the TWI bus to enable communication, but
        //before doing so we need to see if a call from the front end to use a different sensor has been made.
        uint8_t new_sensors = 0;

        if (imu_comm.sensor_model[ACC_SENSOR] != sensor_settings[ACC_START + SENSOR_MODEL])
        {
            new_sensors |= 0b001;
            default_sensors[ACC_SENSOR] = sensor_settings[ACC_START + SENSOR_MODEL];
            sensors_initialized[ACC_SENSOR] = false;
        }

        if (imu_comm.sensor_model[GYR_SENSOR] != sensor_settings[GYR_START + SENSOR_MODEL])
        {
            new_sensors |= 0b010;
            default_sensors[GYR_SENSOR] = sensor_settings[GYR_START + SENSOR_MODEL];
            sensors_initialized[GYR_SENSOR] = false;
        }
        
        if (imu_comm.sensor_model[MAG_SENSOR] != sensor_settings[MAG_START + SENSOR_MODEL])
        {
            new_sensors |= 0b100;
            default_sensors[MAG_SENSOR] = sensor_settings[MAG_START + SENSOR_MODEL];
            sensors_initialized[MAG_SENSOR] = false;
        }

